soporteNuSoap/MensajesSOAP/getWeatherReport.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:si="http://soapinterop.org/xsd" xmlns:nu="capeconnect:GlobalWeather:GlobalWeather">
	<SOAP-ENV:Body>
		<nu:getWeatherReport xmlns:nu="capeconnect:GlobalWeather:GlobalWeather">
			<code xsi:type="xsd:string">87582</code>
		</nu:getWeatherReport>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>